---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ModificationOutsideTransactionException
source: html/8ed2114c-f980-0526-8a88-33b545dcf04e.htm
---
# ModificationOutsideTransactionException Members

Retrieves data needed to serialize the target object.